#include <stdio.h>
#include <iostream>
using namespace std;
int main() {
	setlocale(LC_ALL, "ru");	//Задает локаль, которая будет использоваться текущей программой
	int n1(0), n2(0), n3(0);	//Инициализация переменных
	char p1('-'), p2('-'), p3('-');
	int k1(0), k2(0), k3(0), Sk(0);
	float c1(0), c2(0), c3(0), Sc(0);
	cout << "Введите через Enter номера пакетов: ";	//Ввод данных
	cin >> n1; cin >> n2; cin >> n3;
	cout << "\nВведите через Enter производителя пакетов (примечание М-Microsoft, L-Lotus, S-Sun): ";
	cin >> p1; cin >> p2; cin >> p3;
	cout << "\n\nВведите через Enter кол-во сост. частей: ";
	cin >> k1; cin >> k2; cin >> k3;
	cout << "\n\nВведите через Enter цену пакета: ";
	cin >> c1; cin >> c2; cin >> c3;
	Sc = (c1 + c2 + c3) / 3;	//Расчёт средних значений
	Sk = (k1 + k2 + k3) / 3;
	cout << "\n\n--------------------------------------------------------\n";	//Вывод таблицы
	cout << "|Офисные пакеты                                        |\n";
	cout << "|------------------------------------------------------|\n";
	cout << "| Номер | Производитель |Кол-во сост. частей| Цена ($) |\n";
	cout << "|-------|---------------|-------------------|----------|\n";
	printf_s("|%-7d|%-15c|%-19d|%-10.1f|\n", n1, p1, k1, c1);
	printf_s("|%-7d|%-15c|%-19d|%-10.1f|\n", n2, p2, k2, c2);
	printf_s("|%-7d|%-15c|%-19d|%-10.1f|\n", n3, p3, k3, c3);
	cout << "|-------|---------------|-------------------|----------|\n";
	printf_s("|Среднее|               |%-19d|          |\n", Sk);
	printf_s("|кол-во |               |%-19d|          |\n", Sk);
	printf_s("|частей |               |%-19d|          |\n", Sk);
	cout << "|-------|---------------|-------------------|----------|\n";
	printf_s("|Средняя|               |                   |%-10.1f|\n", Sc);
	printf_s("| цена  |               |                   |%-10.1f|\n", Sc);
	cout << "|------------------------------------------------------|\n";
	cout << "|Примечание: М-Microsoft, L-Lotus, S-Sun               |\n";
	cout << "--------------------------------------------------------\n";
	system("pause");	//системнная пауза
}